---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.EndStation
source: html/cffc9f55-aad7-6af3-2fcd-2c4499171749.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.EndStation Property

The ending station for creating labels in the set, in Revit internal model units (standard Imperial feet).
 The default value is null.
 When null, the station value corresponding to the alignment's DisplayedEndStation is used.

## Syntax (C#)
```csharp
public Nullable<double> EndStation { get; set; }
```